Revit 2027 API
Schema.ListFields Method
 The complete list of fields in the Schema, sorted by name.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Field> ListFields()
Public Function ListFields As IList(Of Field)
public:
IList<Field^>^ ListFields()
member ListFields : unit -> IList<Field>
Return Value
IList<Field>
Exceptions
Exception | Condition
InvalidOperationException |  Reading of Entities of this Schema is not allowed to the current add-in.
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace